<?php
/**
 * Created by PhpStorm.
 * User: Administrator
 * Date: 2018/12/3
 * Time: 17:52
 */
return [
    //反馈类型
    'feed_back_type' => [
        '0' => '课程',
        '1' => '登录',
        '2' => '密码',
        '3' => '手机绑定',
        '4' => '其他'
    ],
    //积分类型0-签到积分1-消费积分2-复利3-抽奖4-上分5-下分
    'integral_type' => [
        '0' => '签到',
        '1' => '消费积分',
        '2' => '复利',
        '3' => '抽奖',
        '4' => '上分(后台操作)',
        '5' => '下分(后台操作)',
        '6' => '注册',
        '7' => '推荐'
    ],
];